The Roof or Floor is no longer horizontal.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId SlabShapeFailedNotHorz { get; }
  Visual Basic
Public Shared ReadOnly Property SlabShapeFailedNotHorz As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ SlabShapeFailedNotHorz {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures SlabShapeFailures Class
  Autodesk.Revit.DB Namespace